# Data cleaning

In [116]:
import pandas as pd
import numpy as np
import scipy.stats as stats
import matplotlib.pyplot as plt

In [ ]:
files_to_import = [degree_top_cat.csv,
                   female_researchers_EU.csv,
                   females_employed_in_ST_EU.csv,
                   graduated_world.csv,
                   males_emplyed_in_ST_EU.csv,
                   mix_data_graduates_school_age.csv,
                   nobel.csv,notes_tall_sele.csv,
                   people_age_tertiary_education.csv,
                   sex_ratio_at_birth_males_chao_et_al.csv,
                   sex_ratio_at_birth.csv,
                   sex_ratio_at_five_years_old.csv,
                   sex_ratio_by_age.csv,
                   share_population_female.csv,
                   tertiary_education_women.csv,
                   women_men_scientist_EU.csv,
                   women_men_scientists_EU_2.csv
                  ]

In [ ]:
'''degree_top_cat.csv,
female_researchers_EU.csv,
females_employed_in_ST_EU.csv,
graduated_world.csv,
males_emplyed_in_ST_EU.csv,
mix_data_graduates_school_age.csv,
nobel.csv,notes_tall_sele.csv,
people_age_tertiary_education.csv,
sex_ratio_at_birth_males_chao_et_al.csv,
sex_ratio_at_birth.csv,
sex_ratio_at_five_years_old.csv,
sex_ratio_by_age.csv,
share_population_female.csv,
tertiary_education_women.csv,
women_men_scientist_EU.csv,
women_men_scientists_EU_2.csv'''

## Sex ratio at birth (males/100 females)

In [53]:
sexr_birth = pd.read_csv("data/sex_ratio_at_birth.csv")

In [54]:
sexr_birth.columns = ['Entity', 'Code', 'Year',
       'male/100female']

In [67]:
sexr_birth[sexr_birth["Year"]==2017]

                   Entity Code  Year  male/100female
20            Afghanistan  AFG  2017           106.0
41                Albania  ALB  2017           107.8
62                Algeria  DZA  2017           105.0
83                 Angola  AGO  2017           103.0
104   Antigua and Barbuda  ATG  2017           103.0
...                   ...  ...   ...             ...
4877            Venezuela  VEN  2017           105.0
4898              Vietnam  VNM  2017           109.7
4939                Yemen  YEM  2017           105.0
4960               Zambia  ZMB  2017           103.0
4981             Zimbabwe  ZWE  2017           102.0

[194 rows x 4 columns]

         Entity Code  Year  male/100female
0   Afghanistan  AFG  1962           106.0
1   Afghanistan  AFG  1967           106.0
2   Afghanistan  AFG  1972           106.0
3   Afghanistan  AFG  1977           106.0
4   Afghanistan  AFG  1982           106.0
5   Afghanistan  AFG  1987           106.0
6   Afghanistan  AFG  1990           106.0
7   Afghanistan  AFG  1992           106.0
8   Afghanistan  AFG  1997           106.0
9   Afghanistan  AFG  2002           106.0
10  Afghanistan  AFG  2007           106.0
11  Afghanistan  AFG  2008           106.0
12  Afghanistan  AFG  2009           106.0
13  Afghanistan  AFG  2010           106.0
14  Afghanistan  AFG  2011           106.0
15  Afghanistan  AFG  2012           106.0
16  Afghanistan  AFG  2013           106.0
17  Afghanistan  AFG  2014           106.0
18  Afghanistan  AFG  2015           106.0
19  Afghanistan  AFG  2016           106.0
20  Afghanistan  AFG  2017           106.0
21      Albania  ALB  1962           107.0
22      Albania  ALB  1967           107.0
23      Albania  ALB  1972           107.0
24      Albania  ALB  1977           107.0

## Sex ratio throught the years (males/100 females)

In [52]:
sexr_years = pd.read_csv("data/sex_ratio_by_age.csv")

In [63]:
sexr_years.head()

,Entity,Code,Year,15_yrs,20_yrs,30_yrs,40_yrs,50_yrs,60_yrs,70_yrs,80_yrs,90_yrs,100_yrs
0,Afghanistan,AFG,1990,107.567880,107.606890,106.470367,97.200196,101.432710,96.413713,90.443686,89.011455,86.713287,42.857143
1,Afghanistan,AFG,1991,108.069693,108.102380,107.016689,101.244920,104.548683,95.638925,91.652546,88.065374,110.526316,42.857143
2,Afghanistan,AFG,1992,108.764971,108.753854,107.698225,105.467180,107.982231,95.461732,92.693197,87.860292,111.612903,50.000000
3,Afghanistan,AFG,1993,109.405085,109.380552,108.395056,108.376955,108.518621,96.194394,94.127130,87.511285,106.214689,50.000000
4,Afghanistan,AFG,1994,109.779351,109.850800,108.881665,109.077761,105.456109,97.710829,96.144108,86.912120,98.876404,50.000000

In [80]:
sexr_years.columns = ['Country', 'Code', 'Year', '100_yrs',
       '15_yrs',
       '20_yrs',
       '30_yrs',
       '40_yrs',
       '50_yrs',
       '60_yrs',
       '70_yrs',
       '80_yrs',
       '90_yrs']

In [81]:
sexr_years = sexr_years[['Country', 'Code', 'Year',
       '15_yrs',
       '20_yrs',
       '30_yrs',
       '40_yrs',
       '50_yrs',
       '60_yrs',
       '70_yrs',
       '80_yrs',
       '90_yrs',
       '100_yrs']]

In [82]:
#should I take the average ratio (over the years)? 

sexr_years.groupby("Country")[['15_yrs',
       '20_yrs',
       '30_yrs',
       '40_yrs',
       '50_yrs',
       '60_yrs',
       '70_yrs',
       '80_yrs',
       '90_yrs',
       '100_yrs']].mean()

,15_yrs,20_yrs,30_yrs,40_yrs,50_yrs,60_yrs,70_yrs,80_yrs,90_yrs,100_yrs
Country,,,,,,,,,,
Afghanistan,106.726386,108.645750,109.383778,107.003561,104.382058,102.168616,85.220051,78.254466,45.141403,105.756304
Africa,100.543197,98.875808,98.023633,95.262832,90.277777,83.367406,75.749919,56.578748,26.854945,101.303343
Albania,106.585146,102.829338,104.371601,106.670667,102.163561,91.914158,76.631521,48.066550,45.880413,106.435468
Algeria,103.748809,101.463374,99.078244,96.862044,96.595066,93.588465,86.142356,75.090386,62.567129,104.044997
Angola,97.077621,94.683326,93.145577,90.201131,84.726234,77.904478,65.817976,46.849330,18.088264,97.528396
...,...,...,...,...,...,...,...,...,...,...
Western Sahara,110.645499,121.693146,134.127766,136.247825,128.438986,114.580409,101.587485,82.318351,NaN,105.186085
World,104.248846,103.044571,101.727257,98.907248,92.655386,81.385579,67.664073,44.240024,23.652859,104.823958
Yemen,102.597591,97.900408,94.074213,92.404423,89.797244,84.552575,85.631492,68.449720,34.236002,102.851101
Zambia,100.129406,98.091042,95.774928,91.049202,87.204443,83.789609,72.951252,59.533645,31.321162,100.762538
Zimbabwe,100.129665,97.476313,94.846030,90.330525,87.028835,82.637450,74.404942,64.503503,35.280093,100.930123

In [70]:
#should I just take the data from the last available year (2015)?

sexr_years[sexr_years["Year"]==2015]

,Entity,Code,Year,15_yrs,20_yrs,30_yrs,40_yrs,50_yrs,60_yrs,70_yrs,80_yrs,90_yrs,100_yrs
25,Afghanistan,AFG,2015,105.998033,107.004742,109.356582,112.198038,108.885775,102.158580,88.325325,80.711219,67.745803,40.000000
91,Africa,NaN,2015,101.975553,101.294583,99.200745,98.422808,95.244795,91.296937,84.479727,74.294529,58.273247,34.992224
157,Albania,ALB,2015,103.116917,114.688507,108.207052,90.521110,95.450063,99.191620,99.775931,90.927054,44.812165,26.530612
223,Algeria,DZA,2015,104.429598,103.603873,101.323156,100.024892,99.750962,105.740137,95.057167,89.289875,89.818306,100.996678
289,Angola,AGO,2015,96.894144,95.968628,94.861455,94.191496,91.776734,87.007881,81.502183,70.626733,46.837945,21.428571
...,...,...,...,...,...,...,...,...,...,...,...,...,...
15601,Western Sahara,ESH,2015,101.800400,102.184054,116.624365,115.955176,126.230228,128.969791,110.152284,105.555556,80.952381,NaN
15667,World,OWID_WRL,2015,106.929543,106.377936,103.539199,102.601921,100.500310,96.396944,89.056243,73.763476,49.640029,25.758375
15733,Yemen,YEM,2015,103.946005,103.603795,101.774333,106.804109,87.666277,96.426777,89.906866,75.825003,72.727273,50.000000
15799,Zambia,ZMB,2015,100.668068,100.064335,99.113205,97.650863,90.362645,76.683425,76.198180,71.351263,56.981132,33.333333
15865,Zimbabwe,ZWE,2015,100.061274,98.386791,91.166891,91.570857,81.394156,69.803147,73.224739,71.741453,59.220146,37.096774

In [83]:
# university wise the ratio we would be interesed in is the 15-20-30 yrs

ratio_uni = sexr_years[sexr_years["Year"]==2015][['Country','15_yrs','20_yrs','30_yrs']]

In [78]:
ratio_uni = ratio_uni.reset_index(drop=True)

In [91]:
ratio_uni.head()

         Country      15_yrs      20_yrs      30_yrs
25   Afghanistan  107.004742  109.356582  112.198038
91        Africa  101.294583   99.200745   98.422808
157      Albania  114.688507  108.207052   90.521110
223      Algeria  103.603873  101.323156  100.024892
289       Angola   95.968628   94.861455   94.191496

## Female Population %

In [85]:
female_wpop = pd.read_csv("data/share_population_female.csv")

In [92]:
female_wpop.columns = ['Country', 'Code', 'Year',
       '%female/%total']

In [98]:
# last year available is 2017
# percentage of females per country

female_2017 = female_wpop[female_wpop['Year']==2017][["Country","%female/%total" ]]

## Tertiary education

In [131]:
tertiary = pd.read_csv('data/mix_data_graduates_school_age.csv')

In [132]:
tertiary.head()

,EDULIT_IND,Indicator,LOCATION,Country,TIME,Time,Value,Flag Codes,Flags
0,FGP_5T8,Percentage of graduates from tertiary educatio...,PSE,Palestine,2013,2013,59.48865,NaN,NaN
1,FGP_5T8,Percentage of graduates from tertiary educatio...,PSE,Palestine,2014,2014,60.41249,NaN,NaN
2,FGP_5T8,Percentage of graduates from tertiary educatio...,PSE,Palestine,2015,2015,60.28197,NaN,NaN
3,FGP_5T8,Percentage of graduates from tertiary educatio...,PSE,Palestine,2016,2016,61.09075,NaN,NaN
4,FGP_5T8,Percentage of graduates from tertiary educatio...,PSE,Palestine,2017,2017,60.81508,NaN,NaN

In [133]:
# renaming columns

tertiary.columns = ['EDULIT_IND', 'Indicator', 'Code', 'Country', 'TIME', 'Year',
       'Value', 'Flag Codes', 'Flags']

In [134]:
# eliminating columns

tertiary = tertiary[['Indicator', 'Code', 'Country', 'Year',
       'Value']]

In [113]:
tertiary['Indicator'].value_counts()

School age population, tertiary education, female (number)                                                                           1079
School age population, tertiary education, both sexes (number)                                                                       1079
School age population, tertiary education, male (number)                                                                             1079
Percentage of graduates from tertiary education who are female (%)                                                                    565
Percentage of graduates from Science, Technology, Engineering and Mathematics programmes in tertiary education, both sexes (%)        412
Percentage of male graduates from Science, Technology, Engineering and Mathematics programmes in tertiary education, male (%)         402
Percentage of female graduates from Science, Technology, Engineering and Mathematics programmes in tertiary education, female (%)     402
Name: Indicator, dtype: int64

In [135]:
tertiary.head()

,Indicator,Code,Country,Year,Value
0,Percentage of graduates from tertiary educatio...,PSE,Palestine,2013,59.48865
1,Percentage of graduates from tertiary educatio...,PSE,Palestine,2014,60.41249
2,Percentage of graduates from tertiary educatio...,PSE,Palestine,2015,60.28197
3,Percentage of graduates from tertiary educatio...,PSE,Palestine,2016,61.09075
4,Percentage of graduates from tertiary educatio...,PSE,Palestine,2017,60.81508

In [142]:
females_ter = tertiary[(tertiary["Indicator"]=='School age population, tertiary education, female (number)') 
         & (tertiary['Year']==2018)]

In [146]:
#indicator and year is the same so we can eliminate it

females_ter = females_ter [['Code', 'Country', 'Value']]

In [149]:
# reset index

females_ter = females_ter.reset_index(drop=True)

In [154]:
females_ter['Country'].values

# it seems that northern America and Europe are catalogued in the same group

array(['China, Macao Special Administrative Region', 'Mozambique',
       'Brunei Darussalam', 'Upper middle income countries',
       'Central Asia', 'El Salvador', 'Cabo Verde', 'Uzbekistan',
       'Kyrgyzstan', 'World', 'China', 'Jamaica', 'Bahrain', 'Niger',
       'Ghana', 'Honduras', 'Arab States', 'Viet Nam', 'Oman', 'Peru',
       'Saint Vincent and the Grenadines', 'Belarus', 'Grenada',
       'Sri Lanka', 'Mongolia', 'Serbia', 'Cambodia', 'Rwanda',
       'Pakistan', 'Latin America and the Caribbean', 'Tunisia',
       'Lower middle income countries', 'Algeria', 'Azerbaijan',
       'High income countries', 'Jordan',
       "Lao People's Democratic Republic", 'Indonesia', 'Bangladesh',
       'Malaysia', 'Saint Lucia', 'Burkina Faso', 'Lesotho', 'Madagascar',
       'Afghanistan', 'Kazakhstan', 'Seychelles', 'Nepal', 'Montenegro',
       'Myanmar', 'Central and Eastern Europe', 'Haiti', 'Armenia',
       'Middle income countries', "Democratic People's Republic of Korea",
       'South and West Asia', 'Colombia', 'Israel',
       'China, Hong Kong Special Administrative Region', 'Saudi Arabia',
       'British Virgin Islands', 'Bermuda', 'Georgia',
       'Republic of Moldova', 'Qatar', 'Holy See',
       'East Asia and the Pacific', 'Costa Rica', 'Sub-Saharan Africa',
       'Togo', 'India', 'Senegal', 'Bhutan', 'Morocco', 'Cuba', 'Albania',
       'Low income countries', 'North America and Western Europe',
       'Kuwait', 'San Marino', 'Palestine', 'United Republic of Tanzania',
       'Landlocked Developing Countries', 'Least Developed Countries',
       'Small Island Developing States', 'World', 'Africa (Sub-Saharan) ',
       'Western Asia and Northern Africa', 'Africa (Northern)',
       'Asia (Western)', 'Asia (Central and Southern)', 'Asia (Southern)',
       'Asia (South-eastern)', 'Oceania',
       'Oceania (Australia/New Zealand)', 'Northern America and Europe',
       'Asia (Central)', 'Asia (Eastern and South-eastern)',
       'Asia (Eastern)', 'Europe', 'Northern America ',
       'Small Island Developing States',
       'Latin America and the Caribbean'], dtype=object)

## Tertiary education (Europe)(females/100 males)

In [162]:
tertiary_EU = pd.read_csv('data/tertiary_education_women.csv')

In [166]:
tertiary_EU.head()

   Year  Country  Value
0  2003  Belgium  114.4
1  2004  Belgium  116.5
2  2005  Belgium  119.4
3  2006  Belgium  120.8
4  2007  Belgium  122.0

In [164]:
tertiary_EU.columns = ['Year', 'Country', 'INDIC_ED', 'Value']

In [165]:
tertiary_EU = tertiary_EU[['Year', 'Country','Value']]

In [173]:
# info is only up to 2012... pretty old...

tertiary_EU[tertiary_EU['Year']==2012]

# but we can see that in general more women go to university than men

     Year                                            Country  Value
9    2012                                            Belgium  124.7
19   2012  French Community in Belgium including small Ge...      :
29   2012                       Flemish Community in Belgium      :
39   2012                                           Bulgaria  120.4
49   2012                                            Czechia  133.9
59   2012                                            Denmark  134.8
69   2012   Germany (until 1990 former territory of the FRG)  100.3
79   2012                                            Estonia  144.9
89   2012                                            Ireland  103.5
99   2012                                             Greece   96.6
109  2012                                              Spain  115.6
119  2012                                             France  121.4
129  2012                                            Croatia  130.8
139  2012                                              Italy  135.3
149  2012                                             Cyprus  113.0
159  2012                                             Latvia  147.6
169  2012                                          Lithuania  140.6
179  2012                                         Luxembourg  108.9
189  2012                                            Hungary  124.7
199  2012                                              Malta  128.0
209  2012                                        Netherlands  105.9
219  2012                                            Austria  114.8
229  2012                                             Poland  149.1
239  2012                                           Portugal  115.0
249  2012                                            Romania  118.9
259  2012                                           Slovenia  136.6
269  2012                                           Slovakia  147.6
279  2012                                            Finland  115.9
289  2012                                             Sweden  148.2
299  2012                                     United Kingdom  128.7
309  2012                                            Iceland  166.4
319  2012                                      Liechtenstein   52.9
329  2012                                             Norway  150.7
339  2012                                        Switzerland   97.2
349  2012                                    North Macedonia  114.1
359  2012                                            Albania      :
369  2012                                             Turkey   83.3
379  2012                             Bosnia and Herzegovina      :

## People in STEM  (EU)

In [175]:
STEM_EU = pd.read_csv('data/women_men_scientists_EU_2.csv')

## Female researchers

In [177]:
female_research_EU = pd.read_csv('data/female_researchers_EU.csv')

## STEM employment

In [179]:
# importing both male and female files

female_STEM_job_EU = pd.read_csv('data/females_employed_in_ST_EU.csv')
male_STEM_job_EU = pd.read_csv('data/males_employed_in_ST_EU.csv')

In [181]:
female_STEM_job_EU.head()

,TIME,GEO,SEX,CATEGORY,NACE_R2,AGE,UNIT,Value
0,2010,European Union - 27 countries (from 2020),Females,Persons with tertiary education (ISCED) and/or...,Total - all NACE activities,From 15 to 74 years,Thousand,"38,068.0"
1,2011,European Union - 27 countries (from 2020),Females,Persons with tertiary education (ISCED) and/or...,Total - all NACE activities,From 15 to 74 years,Thousand,"38,304.2"
2,2012,European Union - 27 countries (from 2020),Females,Persons with tertiary education (ISCED) and/or...,Total - all NACE activities,From 15 to 74 years,Thousand,"39,357.5"
3,2013,European Union - 27 countries (from 2020),Females,Persons with tertiary education (ISCED) and/or...,Total - all NACE activities,From 15 to 74 years,Thousand,"40,051.1"
4,2014,European Union - 27 countries (from 2020),Females,Persons with tertiary education (ISCED) and/or...,Total - all NACE activities,From 15 to 74 years,Thousand,"41,372.5"

## Top degree choices (2019 Catalonia)

In [31]:
degree_top_cat = pd.read_csv("data/degree_top_cat.csv",sep=';')

## University entry grade  ( june 2019 Catalonia)

In [35]:
notes_tall_sele = pd.read_csv("data/notes_tall_sele.csv",sep=';')